Revit 2026 API

# ViewNode Class

---

A render node that represents a view.

SystemObject Autodesk.Revit.DBRenderNode Autodesk.Revit.DBViewNode

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ViewNode : RenderNode
```
```vb
Public Class ViewNode
	Inherits RenderNode
```
```cpp
public ref class ViewNode : public RenderNode
```
```fsharp
type ViewNode =
    class
        inherit RenderNode
    end
```

The ViewNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RenderNode) |
|  | LevelOfDetail | The level of detail the view is going to be rendered at. |
|  | NodeName | A readable name of the output node. (Inherited from RenderNode) |
|  | ViewId | The Id of the view element. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RenderNode) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCameraInfo | Information about the observation point (the camera) of the view. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

See also: [!:Autodesk::Revit::DB::IExportContext::OnViewBegin].

#### Reference

Autodesk.Revit.DB Namespace